In [3]:
import numpy as np
import pandas as pd

In [4]:
u = pd.Series(np.arange(5), index=list("ABCDE"))

In [14]:
df = pd.DataFrame(u)
df2 = pd.DataFrame(np.random.rand(5))
pd.concat([df2,df2], axis =1)

          0         0
0  0.846765  0.846765
1  0.017103  0.017103
2  0.908730  0.908730
3  0.418090  0.418090
4  0.906245  0.906245

In [34]:
df.loc["3"] = "hello"

In [35]:
df

       0      1  hello      2      3
A      0      1      1      1  hello
B      1      2      2      2  hello
C      2      3      3      3  hello
D      3      4      4      4  hello
E      4      5      5      5  hello
2      1      2      3      4  hello
3  hello  hello  hello  hello  hello

In [51]:
df2[df2 > 0.5].dropna()

          0
0  0.846765
2  0.908730
4  0.906245